In [1]:
# import the required packages
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sb

%matplotlib inline

In [2]:
# load the data
orders = pd.read_csv("orders.csv")
order_details = pd.read_csv("order_details.csv")
pizza_types = pd.read_csv("pizza_types.csv", encoding= 'unicode_escape')
pizzas = pd.read_csv("pizzas.csv", encoding= 'unicode_escape')

## Merge the data into one dataframe

In [3]:
new_df = pd.merge(orders, order_details, how='outer')

In [4]:
new_df_pizza = pd.merge(pizzas, pizza_types, how='outer')

In [5]:
new_data = pd.merge(new_df, new_df_pizza, how='outer')

In [6]:
new_data.head()

,order_id,date,time,order_details_id,pizza_id,quantity,pizza_type_id,size,price,name,category,ingredients
0,1.0,2015-01-01,11:38:36,1.0,hawaiian_m,1.0,hawaiian,M,13.25,The Hawaiian Pizza,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese"
1,77.0,2015-01-02,12:22:46,179.0,hawaiian_m,1.0,hawaiian,M,13.25,The Hawaiian Pizza,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese"
2,146.0,2015-01-03,14:22:10,357.0,hawaiian_m,1.0,hawaiian,M,13.25,The Hawaiian Pizza,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese"
3,163.0,2015-01-03,16:54:54,389.0,hawaiian_m,1.0,hawaiian,M,13.25,The Hawaiian Pizza,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese"
4,247.0,2015-01-04,20:55:29,568.0,hawaiian_m,1.0,hawaiian,M,13.25,The Hawaiian Pizza,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese"

In [7]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48625 entries, 0 to 48624
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          48620 non-null  float64
 1   date              48620 non-null  object
 2   time              48620 non-null  object
 3   order_details_id  48620 non-null  float64
 4   pizza_id          48625 non-null  object
 5   quantity          48620 non-null  float64
 6   pizza_type_id     48625 non-null  object
 7   size              48625 non-null  object
 8   price             48625 non-null  float64
 9   name              48625 non-null  object
 10  category          48625 non-null  object
 11  ingredients       48625 non-null  object
dtypes: float64(4), object(8)
memory usage: 4.8+ MB

In [8]:
new_data.isnull().sum()

order_id            5
date                5
time                5
order_details_id    5
pizza_id            0
quantity            5
pizza_type_id       0
size                0
price               0
name                0
category            0
ingredients         0
dtype: int64

In [9]:
# drop null values
new_data = new_data.dropna()

In [10]:
# confirm null values are dropped
new_data.isnull().sum()

order_id            0
date                0
time                0
order_details_id    0
pizza_id            0
quantity            0
pizza_type_id       0
size                0
price               0
name                0
category            0
ingredients         0
dtype: int64

In [11]:
# confirm no null values
new_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48620 entries, 0 to 48619
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          48620 non-null  float64
 1   date              48620 non-null  object
 2   time              48620 non-null  object
 3   order_details_id  48620 non-null  float64
 4   pizza_id          48620 non-null  object
 5   quantity          48620 non-null  float64
 6   pizza_type_id     48620 non-null  object
 7   size              48620 non-null  object
 8   price             48620 non-null  float64
 9   name              48620 non-null  object
 10  category          48620 non-null  object
 11  ingredients       48620 non-null  object
dtypes: float64(4), object(8)
memory usage: 4.8+ MB

# Get the data to the correct data types

In [12]:
# change to int
new_data.order_id = new_data.order_id.astype(int)
new_data.order_details_id = new_data.order_details_id.astype(int)
new_data.quantity = new_data.quantity.astype(int)

In [13]:
# change column from object to date
new_data.date = pd.to_datetime(new_data.date)

In [14]:
new_data.category = new_data.category.astype('category')

In [15]:
new_data['size'] = new_data['size'].astype('category')

In [16]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48620 entries, 0 to 48619
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          48620 non-null  int64
 1   date              48620 non-null  datetime64[ns]
 2   time              48620 non-null  object
 3   order_details_id  48620 non-null  int64
 4   pizza_id          48620 non-null  object
 5   quantity          48620 non-null  int64
 6   pizza_type_id     48620 non-null  object
 7   size              48620 non-null  category
 8   price             48620 non-null  float64
 9   name              48620 non-null  object
 10  category          48620 non-null  category
 11  ingredients       48620 non-null  object
dtypes: category(2), datetime64[ns](1), float64(1), int64(3), object(5)
memory usage: 4.2+ MB

In [17]:
new_data.head()

,order_id,date,time,order_details_id,pizza_id,quantity,pizza_type_id,size,price,name,category,ingredients
0,1,2015-01-01,11:38:36,1,hawaiian_m,1,hawaiian,M,13.25,The Hawaiian Pizza,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese"
1,77,2015-01-02,12:22:46,179,hawaiian_m,1,hawaiian,M,13.25,The Hawaiian Pizza,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese"
2,146,2015-01-03,14:22:10,357,hawaiian_m,1,hawaiian,M,13.25,The Hawaiian Pizza,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese"
3,163,2015-01-03,16:54:54,389,hawaiian_m,1,hawaiian,M,13.25,The Hawaiian Pizza,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese"
4,247,2015-01-04,20:55:29,568,hawaiian_m,1,hawaiian,M,13.25,The Hawaiian Pizza,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese"

In [18]:
new_data.groupby(['size'])['size'].agg('count')

size
L      18526
M      15385
S      14137
XL       544
XXL       28
Name: size, dtype: int64

In [19]:
# add a column for day of the week
new_data["day"] = new_data["date"].dt.day_name()

In [20]:
# change column time from object to datetime
new_data.time = pd.to_datetime(new_data.time)

In [21]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48620 entries, 0 to 48619
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          48620 non-null  int64
 1   date              48620 non-null  datetime64[ns]
 2   time              48620 non-null  datetime64[ns]
 3   order_details_id  48620 non-null  int64
 4   pizza_id          48620 non-null  object
 5   quantity          48620 non-null  int64
 6   pizza_type_id     48620 non-null  object
 7   size              48620 non-null  category
 8   price             48620 non-null  float64
 9   name              48620 non-null  object
 10  category          48620 non-null  category
 11  ingredients       48620 non-null  object
 12  day               48620 non-null  object
dtypes: category(2), datetime64[ns](2), float64(1), int64(3), object(5)
memory usage: 4.5+ MB

In [22]:
# add a column to get the time in hours
new_data["hour"] = new_data["time"].dt.hour

In [23]:
# add a column to get the time in hours
new_data["new_time_again"] = pd.to_datetime(new_data["time"], format='%H:%M').dt.time

In [24]:
new_data['year'] = new_data['date'].dt.year

In [25]:
new_data['month'] = new_data['date'].dt.month

In [26]:
new_data.head()

,order_id,date,time,order_details_id,pizza_id,quantity,pizza_type_id,size,price,name,category,ingredients,day,hour,new_time_again,year,month
0,1,2015-01-01,2023-03-27 11:38:36,1,hawaiian_m,1,hawaiian,M,13.25,The Hawaiian Pizza,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",Thursday,11,11:38:36,2015,1
1,77,2015-01-02,2023-03-27 12:22:46,179,hawaiian_m,1,hawaiian,M,13.25,The Hawaiian Pizza,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",Friday,12,12:22:46,2015,1
2,146,2015-01-03,2023-03-27 14:22:10,357,hawaiian_m,1,hawaiian,M,13.25,The Hawaiian Pizza,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",Saturday,14,14:22:10,2015,1
3,163,2015-01-03,2023-03-27 16:54:54,389,hawaiian_m,1,hawaiian,M,13.25,The Hawaiian Pizza,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",Saturday,16,16:54:54,2015,1
4,247,2015-01-04,2023-03-27 20:55:29,568,hawaiian_m,1,hawaiian,M,13.25,The Hawaiian Pizza,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",Sunday,20,20:55:29,2015,1

In [27]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48620 entries, 0 to 48619
Data columns (total 17 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          48620 non-null  int64
 1   date              48620 non-null  datetime64[ns]
 2   time              48620 non-null  datetime64[ns]
 3   order_details_id  48620 non-null  int64
 4   pizza_id          48620 non-null  object
 5   quantity          48620 non-null  int64
 6   pizza_type_id     48620 non-null  object
 7   size              48620 non-null  category
 8   price             48620 non-null  float64
 9   name              48620 non-null  object
 10  category          48620 non-null  category
 11  ingredients       48620 non-null  object
 12  day               48620 non-null  object
 13  hour              48620 non-null  int64
 14  new_time_again    48620 non-null  object
 15  year              48620 non-null  int64
 16  month             48620 non-null  int64
dtypes: category(2), datetime64[ns](2), float64(1), int64(6), object(6)
memory usage: 6.0+ MB

In [28]:
new_data.nunique()

order_id            21350
date                  358
time                16382
order_details_id    48620
pizza_id               91
quantity                4
pizza_type_id          32
size                    5
price                  25
name                   32
category                4
ingredients            32
day                     7
hour                   15
new_time_again      16382
year                    1
month                  12
dtype: int64

In [29]:
# save to new csv
new_data.to_csv('data.csv', index=False)

In [ ]:
new_data.to_excel('data2.xls', index = False)